Revit 2027 API
SpatialElementBoundaryOptions.StoreFreeBoundaryFaces Property
 Indicates whether to include the free boundary faces in the result.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool StoreFreeBoundaryFaces { get; set; }
Public Property StoreFreeBoundaryFaces As Boolean
	Get
	Set
public:
property bool StoreFreeBoundaryFaces {
	bool get ();
	void set (bool value);
}
member StoreFreeBoundaryFaces : bool with get, set
Property Value
Boolean
Remarks
 A free subface is a portion of a spatial element face that is not (partially) coincident with a face of a bounding element.
See Also
Reference
SpatialElementBoundaryOptions Class
Autodesk.Revit.DB Namespace